server/app/controllers/users/omniauth_callbacks_controller.rb

	def facebook
		@user = User.find_or_create_from_auth_hash auth_hash
---
INSERT INTO "users" ("created_at", "email", "name", "oauth_expires_at", "oauth_token", "provider", "uid", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)